In [ ]:
import pandas as pd
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt

pd.set_option('display.max_columns', None)

# Data Information

In [5]:
df = pd.read_csv("Dataset/Sales Data.csv")
df.head(5)

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,Sales,City,Hour
0,0,295665,Macbook Pro Laptop,1,1700.00,2019-12-30 00:01:00,"136 Church St, New York City, NY 10001",12,1700.00,New York City,0
1,1,295666,LG Washing Machine,1,600.00,2019-12-29 07:03:00,"562 2nd St, New York City, NY 10001",12,600.00,New York City,7
2,2,295667,USB-C Charging Cable,1,11.95,2019-12-12 18:21:00,"277 Main St, New York City, NY 10001",12,11.95,New York City,18
3,3,295668,27in FHD Monitor,1,149.99,2019-12-22 15:13:00,"410 6th St, San Francisco, CA 94016",12,149.99,San Francisco,15
4,4,295669,USB-C Charging Cable,1,11.95,2019-12-18 12:38:00,"43 Hill St, Atlanta, GA 30301",12,11.95,Atlanta,12

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Unnamed: 0        185950 non-null  int64
 1   Order ID          185950 non-null  int64
 2   Product           185950 non-null  object
 3   Quantity Ordered  185950 non-null  int64
 4   Price Each        185950 non-null  float64
 5   Order Date        185950 non-null  object
 6   Purchase Address  185950 non-null  object
 7   Month             185950 non-null  int64
 8   Sales             185950 non-null  float64
 9   City              185950 non-null  object
 10  Hour              185950 non-null  int64
dtypes: float64(2), int64(5), object(4)
memory usage: 15.6+ MB

**Explanation :**
- **Order ID** - A unique ID for each order placed on a product
- **Product** - Item that is purchased
- **Quantity Ordered** - Describes how many of that products are ordered
- **Price Each** - Price of a unit of that product
- **Order Date** - Date on which the order is placed
- **Purchase Address** - Address to where the order is shipped
- **Month, Sales, City, Hour** - Extra attributes formed from the above.

In [9]:
# Change Order Date to Datetime format
df['Order Date'] = pd.to_datetime(df['Order Date'])

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 11 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Unnamed: 0        185950 non-null  int64
 1   Order ID          185950 non-null  int64
 2   Product           185950 non-null  object
 3   Quantity Ordered  185950 non-null  int64
 4   Price Each        185950 non-null  float64
 5   Order Date        185950 non-null  datetime64[ns]
 6   Purchase Address  185950 non-null  object
 7   Month             185950 non-null  int64
 8   Sales             185950 non-null  float64
 9   City              185950 non-null  object
 10  Hour              185950 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(3)
memory usage: 15.6+ MB

In [ ]:
# how to extract the specific time using this

# Year
print(str(df['Order Date'].dt.year.iloc[0])+"\n")

# Month
print(str(df['Order Date'].dt.month.iloc[0])+"\n")

# Date
print(str(df['Order Date'].dt.date.iloc[0])+"\n")

# Time
print(str(df['Order Date'].dt.time.iloc[0])+"\n")

# Hour
print(str(df['Order Date'].dt.hour.iloc[0])+"\n")

# Minute
print(str(df['Order Date'].dt.minute.iloc[0])+"\n")

# Second
print(str(df['Order Date'].dt.second.iloc[0])+"\n\n")

2019


12


2019-12-30


00:01:00


0


1


0

In [25]:
df.isna().sum()

Unnamed: 0          0
Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
Month               0
Sales               0
City                0
Hour                0
dtype: int64

In [31]:
print(df.duplicated().any())

False

# EDA (Explatonary Data Analysis)

In [ ]:
# Drop the columns that we don't need it, which is month, hour, Unnamed
df = df.drop(columns=['Month', 'Hour', 'Unnamed: 0'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  int64
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  int64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  datetime64[ns]
 5   Purchase Address  185950 non-null  object
 6   Sales             185950 non-null  float64
 7   City              185950 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(2), object(3)
memory usage: 11.3+ MB

In [37]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Sales,City
0,295665,Macbook Pro Laptop,1,1700.00,2019-12-30 00:01:00,"136 Church St, New York City, NY 10001",1700.00,New York City
1,295666,LG Washing Machine,1,600.00,2019-12-29 07:03:00,"562 2nd St, New York City, NY 10001",600.00,New York City
2,295667,USB-C Charging Cable,1,11.95,2019-12-12 18:21:00,"277 Main St, New York City, NY 10001",11.95,New York City
3,295668,27in FHD Monitor,1,149.99,2019-12-22 15:13:00,"410 6th St, San Francisco, CA 94016",149.99,San Francisco
4,295669,USB-C Charging Cable,1,11.95,2019-12-18 12:38:00,"43 Hill St, Atlanta, GA 30301",11.95,Atlanta

Disini kita bisa mengekstrak Purcase Address menjadi beberapa bagian

In [41]:
df['State'] = df['Purchase Address'].str.extract(r'([A-Z]{2}) \d{5}')
df['State']

0         NY
1         NY
2         NY
3         CA
4         GA
          ..
185945    MA
185946    NY
185947    CA
185948    CA
185949    GA
Name: State, Length: 185950, dtype: object

In [49]:
df['City'] = df['Purchase Address'].apply(lambda x: x.split(',')[-2].strip())
df['City']

0         New York City
1         New York City
2         New York City
3         San Francisco
4               Atlanta
              ...
185945           Boston
185946    New York City
185947    San Francisco
185948    San Francisco
185949          Atlanta
Name: City, Length: 185950, dtype: object

In [50]:
df['Sales'] = df['Quantity Ordered']*df['Price Each']
df['Sales']

0         1700.00
1          600.00
2           11.95
3          149.99
4           11.95
           ...
185945       2.99
185946     149.99
185947      11.95
185948      11.95
185949       2.99
Name: Sales, Length: 185950, dtype: float64

In [53]:
df['City'].unique()

array(['New York City', 'San Francisco', 'Atlanta', 'Portland', 'Dallas',
       'Los Angeles', 'Boston', 'Austin', 'Seattle'], dtype=object)

In [54]:
df['State'].unique()

array(['NY', 'CA', 'GA', 'OR', 'TX', 'MA', 'ME', 'WA'], dtype=object)

## Data Insight

In [51]:
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,State,City,Sales
0,295665,Macbook Pro Laptop,1,1700.00,2019-12-30 00:01:00,"136 Church St, New York City, NY 10001",NY,New York City,1700.00
1,295666,LG Washing Machine,1,600.00,2019-12-29 07:03:00,"562 2nd St, New York City, NY 10001",NY,New York City,600.00
2,295667,USB-C Charging Cable,1,11.95,2019-12-12 18:21:00,"277 Main St, New York City, NY 10001",NY,New York City,11.95
3,295668,27in FHD Monitor,1,149.99,2019-12-22 15:13:00,"410 6th St, San Francisco, CA 94016",CA,San Francisco,149.99
4,295669,USB-C Charging Cable,1,11.95,2019-12-18 12:38:00,"43 Hill St, Atlanta, GA 30301",GA,Atlanta,11.95

In [ ]:
plt.figure(figsize=(8, 5))
plt.bar(df['City'], df['Quantity Ordered'], color='skyblue')

plt.title('Total Quantity Sold per City')
plt.xlabel('City')
plt.ylabel('Quantity Ordered')
plt.xticks(rotation=90)  # miringkan teks biar rapi
plt.show()